Repository: ntoporcov/openclient
Catalog: OpenCodeIOSClient/Localizable.xcstrings
Source language: en
Languages: it, pt_br

source: Set Up OpenAI Usage
it: Configura l'utilizzo di OpenAI
pt_br: Configurar uso do OpenAI

source: Set up your workspace
it: Configura il tuo workspace
pt_br: Configure seu espaço de trabalho

source: Setting up the session before opening chat.
it: Configurazione della sessione prima di aprire la chat.
pt_br: Configurando a sessão antes de abrir o chat.

source: Setup
it: Configurazione
pt_br: Configuração

source: Setup asks before reading a discovered credential, then saves it automatically when the read succeeds. If this connection cannot securely provide a supported credential, OpenClient will explain why instead.
it: La configurazione chiede conferma prima di leggere una credenziale rilevata, quindi la salva automaticamente se la lettura riesce. Se questa connessione non può fornire in modo sicuro una credenziale supportata, OpenClient ti spiegherà perché.
pt_br: A configuração pede confirmação antes de ler uma credencial encontrada e a salva automaticamente quando a leitura é bem-sucedida. Se esta conexão não puder fornecer com segurança uma credencial compatível, o OpenClient explicará o motivo.

source: Share page
it: Condividi pagina
pt_br: Compartilhar página

source: Shared links now expand into rich, tappable previews after a message finishes streaming.
it: I link condivisi ora si espandono in anteprime ricche e selezionabili dopo che un messaggio termina lo streaming.
pt_br: Os links compartilhados agora se expandem em prévias avançadas e interativas após o término do streaming de uma mensagem.

source: Shared sessions across the current server context
it: Sessioni condivise nel contesto del server corrente
pt_br: Sessões compartilhadas no contexto atual do servidor

source: Ship the TestFlight build
it: Pubblica la build su TestFlight
pt_br: Enviar a build ao TestFlight

source: Short guides for understanding OpenCode, connecting to your server, and using the app with confidence from the start.
it: Brevi guide per capire OpenCode, connetterti al tuo server e usare l'app con sicurezza fin da subito.
pt_br: Guias curtos para entender o OpenCode, conectar-se ao seu servidor e usar o aplicativo com confiança desde o início.

source: Show %@
it: Mostra %@
pt_br: Mostrar %@

source: Show All Models
it: Mostra tutti i modelli
pt_br: Mostrar todos os modelos

source: Show browser controls
it: Mostra controlli browser
pt_br: Mostrar controles do navegador

source: Show Chat Activity Shimmer
it: Mostra shimmer attività chat
pt_br: Mostrar brilho da atividade de chat

source: Show earlier activity
it: Mostra attività precedenti
pt_br: Mostrar atividades anteriores

source: Show Fun & Games
it: Mostra Divertimento e giochi
pt_br: Mostrar diversão e jogos

source: Show Last User Message
it: Mostra ultimo messaggio utente
pt_br: Mostrar última mensagem do usuário

source: Show More
it: Mostra altro
pt_br: Mostrar mais

source: Show Paywall
it: Mostra paywall
pt_br: Mostrar paywall

source: Show Reasoning Blocks
it: Mostra blocchi di ragionamento
pt_br: Mostrar blocos de raciocínio

source: Show Session
it: Mostra sessione
pt_br: Mostrar sessão

source: Show status
it: Mostra stato
pt_br: Mostrar status

source: Show Tool Calls
it: Mostra chiamate agli strumenti
pt_br: Mostrar chamadas de ferramentas

source: Show Workspaces
it: Mostra workspace
pt_br: Mostrar espaços de trabalho

# Showing %lld lines for %@ matching "%@".
source: Showing %1$lld lines for %2$@ matching "%3$@".
it: Visualizzazione di %1$lld righe per %2$@ corrispondenti a "%3$@".
pt_br: Mostrando %1$lld linhas de %2$@ correspondentes a "%3$@".

# Showing %lld lines for %@.
source: Showing %1$lld lines for %2$@.
it: Visualizzazione di %1$lld righe per %2$@.
pt_br: Mostrando %1$lld linhas de %2$@.

# Showing 1 line for %@ matching "%@".
source: Showing 1 line for %1$@ matching "%2$@".
it: Visualizzazione di 1 riga per %1$@ corrispondente a "%2$@".
pt_br: Mostrando 1 linha de %1$@ correspondente a "%2$@".

source: Showing 1 line for %@.
it: Visualizzazione di 1 riga per %@.
pt_br: Mostrando 1 linha de %@.

source: Showing available metrics until you choose Home or Activity.
it: Le metriche disponibili vengono mostrate finché non scegli Home o Attività.
pt_br: As métricas disponíveis são exibidas até você escolher Início ou Atividade.

source: Shows an animated highlight at the top of a chat while the AI is active.
it: Mostra un'evidenziazione animata in cima alla chat mentre l'IA è attiva.
pt_br: Mostra um destaque animado na parte superior do chat enquanto a IA está ativa.

source: Small changes, right where they count
it: Piccole modifiche, esattamente dove contano
pt_br: Pequenas mudanças, exatamente onde elas contam

source: Smooshing
it: Impastando
pt_br: Amassando

source: Smoother around the edges
it: Miglioramenti in ogni dettaglio
pt_br: Mais melhorias em cada detalhe

source: Some files were skipped because attachments are limited to %@ per message.
it: Alcuni file sono stati ignorati perché gli allegati sono limitati a %@ per messaggio.
pt_br: Alguns arquivos foram ignorados porque os anexos estão limitados a %@ por mensagem.

source: Some images were skipped because attachments are limited to %@ per message.
it: Alcune immagini sono state ignorate perché gli allegati sono limitati a %@ per messaggio.
pt_br: Algumas imagens foram ignoradas porque os anexos estão limitados a %@ por mensagem.

source: Source
it: Sorgente
pt_br: Fonte

source: Southern Hemisphere
it: Emisfero meridionale
pt_br: Hemisfério Sul

source: Speak naturally with OpenClient, hear answers sooner, and keep the conversation going from the Lock Screen.
it: Parla in modo naturale con OpenClient, ascolta prima le risposte e continua la conversazione dalla schermata di blocco.
pt_br: Converse naturalmente com o OpenClient, ouça respostas mais cedo e continue a conversa pela Tela Bloqueada.

source: Speaking...
it: Riproduzione vocale...
pt_br: Falando...

source: Spelunking
it: Esplorando
pt_br: Espeleologia

source: Spend
it: Spesa
pt_br: Gasto

source: Spending limit
it: Limite di spesa
pt_br: Limite de gastos

source: Spot the hidden bug in a generated code snippet
it: Individua il bug nascosto in uno snippet di codice generato
pt_br: Identifique o bug oculto em um trecho de código gerado

source: Start a Live Activity automatically when a session begins working in this project.
it: Avvia automaticamente un'attività in tempo reale quando una sessione inizia a lavorare in questo progetto.
pt_br: Inicie automaticamente uma Atividade ao Vivo quando uma sessão começar a trabalhar neste projeto.

source: Start a shell in this workspace.
it: Avvia una shell in questo workspace.
pt_br: Inicie um shell neste espaço de trabalho.

source: Start a voice conversation from Projects, Activity, session lists, or any chat, with automatic and hold-to-talk controls.
it: Avvia una conversazione vocale da Progetti, Attività, elenchi delle sessioni o qualsiasi chat, con controlli automatici e premi per parlare.
pt_br: Inicie uma conversa por voz em Projetos, Atividade, listas de sessões ou qualquer chat, com controles automáticos e de segurar para falar.

source: Start Anywhere
it: Inizia ovunque
pt_br: Comece em qualquer lugar

source: Start Conversation
it: Avvia conversazione
pt_br: Iniciar conversa

source: Start from a message
it: Inizia da un messaggio
pt_br: Comece com uma mensagem

source: Start from anywhere
it: Inizia da qualsiasi punto
pt_br: Comece de qualquer lugar

source: Start OpenClient Session
it: Avvia sessione OpenClient
pt_br: Iniciar sessão OpenClient

source: Start OpenClient Session and Send Message
it: Avvia sessione OpenClient e invia messaggio
pt_br: Iniciar sessão OpenClient e enviar mensagem

source: Start Probe
it: Avvia sonda
pt_br: Iniciar diagnóstico

source: Start Session
it: Avvia sessione
pt_br: Iniciar sessão

source: Started %@ and sent the message.
it: %@ avviata e messaggio inviato.
pt_br: Iniciou %@ e enviou a mensagem.

source: Started %@.
it: %@ avviata.
pt_br: Iniciado %@.

source: Starting conversation...
it: Avvio conversazione...
pt_br: Iniciando conversa...

source: Starting HLS on the OpenCode host
it: Avvio HLS sull'host OpenCode
pt_br: Iniciando HLS no host OpenCode

source: Starting live updates
it: Avvio aggiornamenti in tempo reale
pt_br: Iniciando atualizações ao vivo

source: Starting OAuth...
it: Avvio OAuth...
pt_br: Iniciando OAuth...

source: Static HTML visual
it: Contenuto visivo HTML statico
pt_br: Visual HTML estático

source: Status
it: Stato

source: Status Unknown
it: Stato sconosciuto
pt_br: Status desconhecido

source: Status: %@
it: Stato: %@

source: Stop
it: Ferma
pt_br: Parar

source: Stop Conversation
it: Interrompi conversazione
pt_br: Encerrar conversa

source: Stop Dictation
it: Ferma dettatura
pt_br: Parar ditado

source: Stop Live
it: Ferma Live
pt_br: Parar transmissão ao vivo

source: Stop loading
it: Interrompi caricamento
pt_br: Parar carregamento

source: Stop Preview
it: Interrompi anteprima
pt_br: Parar prévia

source: Stop Stream
it: Interrompi stream
pt_br: Parar streaming

source: Stopped
it: Fermato
pt_br: Parado

source: Stored Credential
it: Credenziale memorizzata
pt_br: Credencial armazenada

source: Sub agents
it: Subagenti
pt_br: Subagentes

source: Subagent
it: Subagente
pt_br: Subagente

source: Subagent sessions cannot be prompted.
it: Le sessioni dei subagenti non possono ricevere prompt.
pt_br: Não é possível enviar prompts a sessões de subagentes.

source: Submission cancelled
it: Invio annullato
pt_br: Envio cancelado

source: Submission details
it: Dettagli dell'invio
pt_br: Detalhes do envio

source: Submission status unknown
it: Stato dell'invio sconosciuto
pt_br: Status do envio desconhecido

source: Submission unconfirmed
it: Invio non confermato
pt_br: Envio não confirmado

source: Submit
it: Invia
pt_br: Enviar

source: Succeeded
it: Riuscita
pt_br: Concluído com sucesso

source: Succeeded, Hidden Locally
it: Riuscita, nascosta localmente
pt_br: Concluído com sucesso, oculto localmente

source: Success
it: Operazione riuscita
pt_br: Sucesso

source: Summarize context
it: Riassumi contesto
pt_br: Resumir contexto

source: Summarize the session context
it: Riassumi il contesto della sessione
pt_br: Resumir o contexto da sessão

source: Supports the open-source app
it: Sostiene l'app open source
pt_br: Apoia o app de código aberto

source: Surf responsibly. Some links can be a little clickbaity.
it: Naviga responsabilmente. Alcuni link possono essere un po' acchiappaclic.
pt_br: Surfe com responsabilidade. Alguns links podem ser um pouco caça-cliques.

source: Switch between free, StoreKit, unlocked, and limit-reached states while testing local builds.
it: Passa tra gli stati gratuito, StoreKit, sbloccato e limite raggiunto durante il test delle build locali.
pt_br: Alterne entre os estados gratuito, StoreKit, desbloqueado e limite atingido ao testar builds locais.

source: System
it: Sistema
pt_br: Sistema

source: System Default
it: Predefinito di sistema
pt_br: Padrão do sistema

source: System Prompt
it: Prompt di sistema
pt_br: Prompt do sistema

source: Take a byte out of the internet.
it: Dai un morso a Internet, un byte alla volta.
pt_br: Dê uma mordida na internet, um byte de cada vez.

source: Talk
it: Parla
pt_br: Falar

source: Talk it through
it: Parliamone
pt_br: Vamos conversar

source: Talk Model
it: Modello per conversazioni vocali
pt_br: Modelo de conversa por voz

source: Tasks
it: Attività
pt_br: Tarefas

source: temperate/subtropical latitude
it: latitudine temperata/subtropicale
pt_br: latitude temperada/subtropical

source: Temporarily rate limited
it: Limite di richieste temporaneo
pt_br: Limite de requisições temporário

source: Terminal
it: Terminale

source: Terminal Closed
it: Terminale chiuso
pt_br: Terminal fechado

source: Terminal Sessions
it: Sessioni del terminale
pt_br: Sessões de terminal

source: Terminal viewport
it: Viewport terminale
pt_br: Janela de visualização do terminal

source: Terms of Use
it: Termini di utilizzo
pt_br: Termos de Uso

source: Text File
it: File di testo
pt_br: Arquivo de texto

# Thank you, %@ (%@), for translating OpenClient into %@.
source: Thank you, %1$@ (%2$@), for translating OpenClient into %3$@.
it: Grazie, %1$@ (%2$@), per aver tradotto OpenClient in %3$@.
pt_br: Obrigado, %1$@ (%2$@), por traduzir o OpenClient para %3$@.

source: Thanks to the Excalidraw project
it: Grazie al progetto Excalidraw
pt_br: Agradecimentos ao projeto Excalidraw

source: Thanks to the OpenCode maintainers
it: Grazie ai maintainer di OpenCode
pt_br: Agradecimentos aos mantenedores do OpenCode

source: The /%@ command is not available in this project.
it: Il comando /%@ non è disponibile in questo progetto.
pt_br: O comando /%@ não está disponível neste projeto.

source: The browser address is invalid.
it: L'indirizzo del browser non è valido.
pt_br: O endereço da web é inválido.

source: The browser element reference is missing or stale. Take a new snapshot.
it: Il riferimento all'elemento del browser è mancante o obsoleto. Acquisisci un nuovo snapshot.
pt_br: A referência do elemento do navegador está ausente ou obsoleta. Tire um novo instantâneo.

source: The browser history action is unsupported.
it: L'azione della cronologia del browser non è supportata.
pt_br: A ação do histórico do navegador não é compatível.

source: The browser is open-minded. Every tab gets a chance.
it: Il browser è di larghe vedute. Ogni scheda ha la sua occasione.
pt_br: O navegador tem a mente aberta. Toda aba tem sua chance.

source: The bundled Excalidraw app could not be found. Rebuild the iOS app resources.
it: L'app Excalidraw inclusa non è stata trovata. Ricostruisci le risorse dell'app iOS.
pt_br: O aplicativo Excalidraw incluído não foi encontrado. Recrie os recursos do aplicativo iOS.

source: The conversation listens and sends automatically.
it: La conversazione ascolta e invia automaticamente.
pt_br: A conversa ouve e envia automaticamente.

source: The credential helper could not be cleaned up safely.
it: Non è stato possibile ripulire in sicurezza l'helper delle credenziali.
pt_br: Não foi possível limpar o auxiliar de credenciais com segurança.

source: The credential helper could not connect. Check the server connection and try again.
it: L'helper delle credenziali non è riuscito a connettersi. Controlla la connessione al server e riprova.
pt_br: Não foi possível conectar o auxiliar de credenciais. Verifique a conexão com o servidor e tente novamente.

source: The credential helper returned more data than allowed.
it: L'helper delle credenziali ha restituito più dati del consentito.
pt_br: O auxiliar de credenciais retornou mais dados do que o permitido.

source: The credential helper started, but OpenClient could not attach to it.
it: L'helper delle credenziali è stato avviato, ma OpenClient non è riuscito a collegarsi.
pt_br: O auxiliar de credenciais foi iniciado, mas o OpenClient não conseguiu se conectar a ele.

source: The credential helper timed out. Try again.
it: L'helper delle credenziali ha raggiunto il timeout. Riprova.
pt_br: O auxiliar de credenciais atingiu o tempo limite. Tente novamente.

source: The credential helper's secure handshake or response was invalid. Try again.
it: L'handshake sicuro o la risposta dell'helper delle credenziali non era valida. Riprova.
pt_br: O handshake seguro ou a resposta do auxiliar de credenciais era inválido. Tente novamente.

source: The daily free prompt limit has been reached. Open OpenClient to upgrade for unlimited prompts.
it: Il limite giornaliero di prompt gratuiti è stato raggiunto. Apri OpenClient per passare a prompt illimitati.
pt_br: O limite diário de prompts gratuitos foi atingido. Abra o OpenClient para fazer upgrade e ter prompts ilimitados.

source: The drawing app failed to initialize.
it: L'app di disegno non è riuscita a inizializzarsi.
pt_br: O aplicativo de desenho falhou ao inicializar.

source: The drawing app loaded, but the exporter did not initialize.
it: L'app di disegno si è caricata, ma l'esportatore non si è inizializzato.
pt_br: O aplicativo de desenho foi carregado, mas o exportador não foi inicializado.

source: The drawing export script failed: %@
it: Lo script di esportazione del disegno non è riuscito: %@
pt_br: O script de exportação do desenho falhou: %@

source: The drawing tool failed to load: %@
it: Lo strumento di disegno non si è caricato: %@
pt_br: A ferramenta de desenho falhou ao carregar: %@

source: The drawing tool returned an unexpected response.
it: Lo strumento di disegno ha restituito una risposta inattesa.
pt_br: A ferramenta de desenho retornou uma resposta inesperada.

source: The exported drawing data could not be decoded.
it: Impossibile decodificare i dati del disegno esportato.
pt_br: Os dados do desenho exportados não puderam ser decodificados.

source: The exported drawing was not a valid PNG image.
it: Il disegno esportato non era un'immagine PNG valida.
pt_br: O desenho exportado não era uma imagem PNG válida.

source: The floating New Chat button starts an unscoped conversation and lets you choose its project when you are ready.
it: Il pulsante flottante Nuova chat avvia una conversazione senza progetto e ti permette di sceglierne uno quando sei pronto.
pt_br: O botão flutuante Novo chat inicia uma conversa sem escopo e permite que você escolha seu projeto quando estiver pronto.

source: The form is still pending. Review your answers before trying again.
it: Il modulo è ancora in attesa. Rivedi le risposte prima di riprovare.
pt_br: O formulário ainda está pendente. Revise suas respostas antes de tentar novamente.

source: The form status is unknown. Check status before trying again.
it: Lo stato del modulo è sconosciuto. Verifica lo stato prima di riprovare.
pt_br: O status do formulário é desconhecido. Verifique o status antes de tentar novamente.

source: The image dimensions do not match the persisted metadata.
it: Le dimensioni dell'immagine non corrispondono ai metadati salvati.
pt_br: As dimensões da imagem não correspondem aos metadados persistentes.

source: The image exceeds the supported size limit.
it: L'immagine supera il limite di dimensione supportato.
pt_br: A imagem excede o limite de tamanho suportado.

source: The image service returned an empty image.
it: Il servizio immagini ha restituito un'immagine vuota.
pt_br: O serviço de imagem retornou uma imagem vazia.

source: The image service returned an unexpected content type.
it: Il servizio immagini ha restituito un tipo di contenuto inatteso.
pt_br: O serviço de imagem retornou um tipo de conteúdo inesperado.

source: The image service returned an unexpected number of bytes.
it: Il servizio immagini ha restituito un numero di byte inatteso.
pt_br: O serviço de imagem retornou um número inesperado de bytes.

source: The image service returned data that cannot be displayed as an image.
it: Il servizio immagini ha restituito dati che non possono essere visualizzati come immagine.
pt_br: O serviço de imagem retornou dados que não podem ser exibidos como imagem.

source: The image service returned HTTP %lld.
it: Il servizio immagini ha restituito HTTP %lld.
pt_br: O serviço de imagem retornou HTTP %lld.

source: The interactive preview will be available when rendering finishes
it: L'anteprima interattiva sarà disponibile al termine del rendering
pt_br: A prévia interativa estará disponível quando a renderização terminar

source: The internet called. It left a hyperlink.
it: Internet ha chiamato. Ha lasciato un collegamento.
pt_br: A internet ligou. Deixou um hiperlink.

source: The latest context, live
it: Il contesto più recente, in tempo reale
pt_br: O contexto mais recente, ao vivo

source: The OC Notify setup code is expired or invalid.
it: Il codice di configurazione di OC Notify è scaduto o non valido.
pt_br: O código de configuração do OC Notify expirou ou é inválido.

source: The OpenClient bridge message has an invalid %@ field.
it: Il messaggio del bridge OpenClient ha un campo %@ non valido.
pt_br: A mensagem da ponte OpenClient possui um campo %@ inválido.

source: The OpenClient bridge sent an unsupported message.
it: Il bridge OpenClient ha inviato un messaggio non supportato.
pt_br: A ponte OpenClient enviou uma mensagem não suportada.

source: The OpenClient plugin image endpoint is invalid.
it: L'endpoint immagine del plugin OpenClient non è valido.
pt_br: O endpoint da imagem do plugin OpenClient é inválido.

source: The OpenClient plugin image path is invalid.
it: Il percorso immagine del plugin OpenClient non è valido.
pt_br: O caminho da imagem do plugin OpenClient é inválido.

source: The OpenClient plugin now bundles OC Notify, a Home Screen web app that can alert you when a session becomes idle after activity or needs a permission or question answered.
it: Il plugin OpenClient ora include OC Notify, un'app web per la schermata Home che può avvisarti quando una sessione diventa inattiva dopo un'attività o richiede una risposta a un'autorizzazione o a una domanda.
pt_br: O plugin OpenClient agora inclui o OC Notify, um app web para a Tela de Início que pode avisar quando uma sessão fica ociosa após uma atividade ou precisa que uma permissão ou pergunta seja respondida.

source: The OpenClient plugin returned an invalid image response.
it: Il plugin OpenClient ha restituito una risposta immagine non valida.
pt_br: O plugin OpenClient retornou uma resposta de imagem inválida.

source: The OpenClient plugin returned an invalid video response.
it: Il plugin OpenClient ha restituito una risposta video non valida.
pt_br: O plugin OpenClient retornou uma resposta de vídeo inválida.

source: The OpenClient plugin video endpoint is invalid.
it: L'endpoint video del plugin OpenClient non è valido.
pt_br: O endpoint de vídeo do plugin OpenClient é inválido.

source: The OpenClient server URL is invalid.
it: L'URL del server OpenClient non è valido.
pt_br: A URL do servidor OpenClient é inválida.

source: The OpenCode server URL cannot be used for OpenClient bridge discovery.
it: L'URL del server OpenCode non può essere usato per il rilevamento del bridge OpenClient.
pt_br: A URL do servidor OpenCode não pode ser usada para descobrir a ponte do OpenClient.

source: The primary workspace cannot be reset or deleted.
it: Il workspace principale non può essere ripristinato o eliminato.
pt_br: O espaço de trabalho principal não pode ser redefinido ou excluído.

source: The provider request failed. Refresh connection status before trying again.
it: La richiesta al provider non è riuscita. Aggiorna lo stato della connessione prima di riprovare.
pt_br: A solicitação ao provedor falhou. Atualize o status da conexão antes de tentar novamente.

source: The referenced element does not support this browser action.
it: L'elemento di riferimento non supporta questa azione del browser.
pt_br: O elemento referenciado não suporta esta ação do navegador.

source: The safest setup is usually a private network path to your OpenCode server, not a public port on the open internet.
it: La configurazione più sicura è di solito un percorso di rete privato verso il tuo server OpenCode, non una porta pubblica esposta su internet.
pt_br: A configuração mais segura geralmente é um caminho de rede privada para o servidor OpenCode, não uma porta pública na Internet aberta.

source: The saved Apple Intelligence folder is no longer available. Please pick it again.
it: La cartella di Apple Intelligence salvata non è più disponibile. Selezionala di nuovo.
pt_br: A pasta Apple Intelligence salva não está mais disponível. Por favor, escolha novamente.

source: The saved OpenClient credentials are unavailable.
it: Le credenziali OpenClient salvate non sono disponibili.
pt_br: As credenciais OpenClient salvas não estão disponíveis.
